app/Http/Controllers/Site/SiteController.php

    public function index(){

        $plans = Plan::orderBy('plan_price', 'ASC')->get();
---
select * from `plans` order by `plan_price` asc

    public function plan($url)
    {
        if (!$plan = Plan::where('url', $url)->first()) {
---
select * from `plans` where `url` = 'plano-free' limit 1