app/Http/Controllers/API/Auth/AuthClientController.php

    public function authClient(Request $request)
    {
        //VALIDAR DADOS DO CLIENTE
        $request->validate([
                'client_email' => 'required|email',
                'password' => 'required',
                'device_name' => 'required',
            ]);

        //BUSCAR CLIENTE EMAIL
            $client = Client::where('client_email', $request->client_email)->first();
---
select * from `clients` where `client_email` = 'beatriz@gmail.com' limit 1