app/Http/Controllers/Admin/HomeController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `tenants`
select count(*) as aggregate from `plans`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `profiles`
select count(*) as aggregate from `permissions`
---
    public function home(){

        $tenant = auth()->user()->tenant;

        $totalUsers = User::count();
        $totalCategories = Category::count();
        $totalFoods = Food::count();
        $totalTenants = Tenant::count();
        $totalPlans = Plan::count();
        $totalRoles = Role::count();
        $totalProfiles = Profile::count();
        $totalPermissions = Permission::count();