app/Http/Controllers/Admin/PermissionProfileController.php

    public function permissions($idProfile)
    {
        $profile  = $this->profile->find($idProfile);

        if(!$profile){
            return redirect()->back();
        }

        $permissions = $profile->permissions()->paginate();
---
select * from `profiles` where `profiles`.`id` = '1' limit 1
select count(*) as aggregate from `permissions` inner join `permission_profile` on `permissions`.`id` = `permission_profile`.`permission_id` where `permission_profile`.`profile_id` = 1

   public function permissionsAvailable(Request $request, $idProfile)
   {

        if(!$profile = $this->profile->find($idProfile))
---
select * from `profiles` where `profiles`.`id` = '1' limit 1