app/Repositories/FoodRepository.php

select `foods`.* from `foods` inner join `category_food` on `category_food`.`food_id` = `foods`.`id` inner join `categories` on `category_food`.`category_id` = `categories`.`id` where `foods`.`tenant_id` = 1 and `categories`.`tenant_id` = 1
---
    public function getFoodByTenantId(int $idTenant, array $categories)
    {
        return DB::table($this->table)
                    ->join('category_food', 'category_food.food_id', '=', 'foods.id')
                    ->join('categories', 'category_food.category_id', '=', 'categories.id')
                    ->where('foods.tenant_id', $idTenant)
                    ->where('categories.tenant_id', $idTenant)
                    ->where(function ($query) use ($categories) {
                        if ($categories != [])
                            $query->whereIn('categories.uuid', $categories);
                    })
                    ->select('foods.*')
                    ->get();