app/Repositories/OrderRepository.php

insert into `orders` (`tenant_id`, `identify`, `total`, `payment`, `order_status`, `comments`, `adress`, `client_id`, `updated_at`, `created_at`) values (1, '2qzt2r4l', 34, 'Pix no Local', 'Aguardando', 'Sem cebola', 'Rua Jair Natal 366 - Santa Luzia', 1, '2023-06-05 22:37:05', '2023-06-05 22:37:05')
---
    public function createNewOrder(
        string $identify,
        float $total,
        string $order_status,
        int $tenant_id,
        string $order_comment = '',
        $client_id = ''
        )

        {
            $data = [
                    'tenant_id' => $tenant_id,
                    'identify' => $identify,
                    'total' => $total,
                    'order_status' => $order_status,
                    'order_comment' => $order_comment,
            ];

        if($client_id) $data['client_id'] = $client_id;

        $order = $this->entity->create($data);

insert into `food_order` (`food_id`, `order_id`, `price`, `quantity`) values (5, 26, 12, 2), (24, 26, 5, 2)
---
    public function registerFoodsOrder(int $orderId, array $foods)
    {
        //ADICIONAR OS ITENS ADQUIRIDOS NA TABELA PIVO
        $order = $this->entity->find($orderId);

        $orderFoods = [];

        foreach ($foods as $food) {
            $orderFoods[$food['id']] = [
                'quantity' => $food['quantity'],
                'price' => $food['price'],
            ];
        }

        $order->foods()->attach($orderFoods);